In [2]:
import pandas as pd

In [6]:
d={'name':['anil','kunal','ajay','ravi'],
  'salary':[20000,50000,40000,10000]}
df1=pd.DataFrame(d)
df1

    name  salary
0   anil   20000
1  kunal   50000
2   ajay   40000
3   ravi   10000

In [7]:
d={'name':['ajay','ravi','ram'],
  'salary':[90000,110000,23000]}
df2=pd.DataFrame(d)
df2

   name  salary
0  ajay   90000
1  ravi  110000
2   ram   23000

In [8]:
display(df1,df2)

    name  salary
0   anil   20000
1  kunal   50000
2   ajay   40000
3   ravi   10000

   name  salary
0  ajay   90000
1  ravi  110000
2   ram   23000

In [20]:
newdf=df1.merge(df2,how='outer',on='name')
newdf

    name  salary_x  salary_y
0   anil   20000.0       NaN
1  kunal   50000.0       NaN
2   ajay   40000.0   90000.0
3   ravi   10000.0  110000.0
4    ram       NaN   23000.0

In [19]:
for i in newdf.salary_y:
    print(i)
[i for i in newdf.salary_y if i!='']

nan
nan
90000.0
110000.0
23000.0

[nan, nan, 90000.0, 110000.0, 23000.0]

In [18]:
newdf.salary_x=[i for i in newdf.salary_y if i!='nan']

0    20000.0
1    50000.0
2    40000.0
3    10000.0
4        NaN
Name: salary_x, dtype: float64

In [23]:
df3=df1.merge(df2,how='right',on='name')

In [24]:
df3.salary_x=[i for i in df3.salary_y]

In [25]:
df3

   name  salary_x  salary_y
0  ajay     90000     90000
1  ravi    110000    110000
2   ram     23000     23000

In [29]:
res=df1.merge(df2,how='outer',on='name')

In [33]:
res.salary_x.map({20000.0: nan, 50000.0: nan, 40000.0: 90000.0, 10000.0: 110000.0, nan: 23000.0})

NameError: name 'nan' is not defined

In [32]:
{i:j for i,j in zip(res.salary_x,res.salary_y)}

{20000.0: nan, 50000.0: nan, 40000.0: 90000.0, 10000.0: 110000.0, nan: 23000.0}

In [37]:
df1.salary

0    20000
1    50000
2    40000
3    10000
Name: salary, dtype: int64

In [38]:
['eligible' if (df1.salary>40000) else 'not eligible']

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [35]:
df1['status']=['eligible' if (df1.salary>40000) else 'not eligible']

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [48]:
df1

    name  salary
0   anil   20000
1  kunal   50000
2   ajay   40000
3   ravi   10000

In [51]:
df['status']=pd.cut(x=[df1['salary']],bins=[1,40000,1000000],labels=['low','high'],right=False)

ValueError: Input array must be 1 dimensional

In [ ]:
info_nums['nums_labels'] = pd.cut(x=info_nums['num'], bins=[1, 7, 10], labels=['Lows', 'Highs'], right=False)

In [40]:
d={'name':['anil','kunal','ajay','ravi','anil','kunal'],
  'salary':[20000,50000,40000,10000,23500,34500]}
df01=pd.DataFrame(d)
df01

    name  salary
0   anil   20000
1  kunal   50000
2   ajay   40000
3   ravi   10000
4   anil   23500
5  kunal   34500

In [45]:
df01.groupby(['name']).sum().reset_index()

    name  salary
0   ajay   40000
1   anil   43500
2  kunal   84500
3   ravi   10000

In [ ]:
select name from employee where salary>40000

In [46]:
l=[34,5,67,8,8,8,6,6,6,5,4,3,3,2,2]
d=[]
res=[d.append(i) for i in l if i not in d]
d

[34, 5, 67, 8, 6, 4, 3, 2]

In [47]:
l1=['anil','ravi','chandu']
l2=[23000,34000,45000]
res={i:j for i,j in zip(l1,l2)}
res

{'anil': 23000, 'ravi': 34000, 'chandu': 45000}